#外掛工具
import taichi as ti
import numpy as np
import sys, os
sys.path.insert(0, os.path.join(os.path.dirname(__file__), '..'))
import config as cfg

#MRT矩陣全域化
M = ti.field(ti.f32, shape=(9, 9))
M_inv = ti.field(ti.f32, shape=(9, 9))

#計算平衡分佈函數（於core.forcing調用）
@ti.func
def feq_single(i: int, rho: float, ux: float, uy: float) -> float:
    cu  = float(cfg.CX[i]) * ux + float(cfg.CY[i]) * uy
    u2  = ux * ux + uy * uy
    return rho * cfg.W[i] * (1.0 + 3.0*cu + 4.5*cu*cu - 1.5*u2)

#初始化MRT矩陣（於main中調用）
def init_mrt_matrices():
    #Ｍ矩陣
    M_np = np.array([
        [1.0,  1.0,  1.0,  1.0,  1.0,  1.0,  1.0,  1.0,  1.0],
        [-4.0, -1.0, -1.0, -1.0, -1.0,  2.0,  2.0,  2.0,  2.0],
        [4.0, -2.0, -2.0, -2.0, -2.0,  1.0,  1.0,  1.0,  1.0],
        [0.0,  1.0,  0.0, -1.0,  0.0,  1.0, -1.0, -1.0,  1.0],
        [0.0, -2.0,  0.0,  2.0,  0.0,  1.0, -1.0, -1.0,  1.0],
        [0.0,  0.0,  1.0,  0.0, -1.0,  1.0,  1.0, -1.0, -1.0],
        [0.0,  0.0, -2.0,  0.0,  2.0,  1.0,  1.0, -1.0, -1.0],
        [0.0,  1.0, -1.0,  1.0, -1.0,  0.0,  0.0,  0.0,  0.0],
        [0.0,  0.0,  0.0,  0.0,  0.0,  1.0, -1.0,  1.0, -1.0]
    ], dtype=np.float32)
    M.from_numpy(M_np)

    # M之反矩陣
    M_inv_np = np.array([
        [1/9,  -1/9,   1/9,    0,      0,      0,      0,     0,     0  ],
        [1/9,  -1/36, -1/18,  1/6,   -1/6,    0,      0,     1/4,   0  ],
        [1/9,  -1/36, -1/18,  0,      0,      1/6,   -1/6,  -1/4,   0  ],
        [1/9,  -1/36, -1/18, -1/6,   1/6,    0,      0,     1/4,   0  ],
        [1/9,  -1/36, -1/18,  0,      0,     -1/6,   1/6,  -1/4,   0  ],
        [1/9,   1/18,  1/36,  1/6,   1/12,   1/6,   1/12,   0,     1/4],
        [1/9,   1/18,  1/36, -1/6,  -1/12,   1/6,   1/12,   0,    -1/4],
        [1/9,   1/18,  1/36, -1/6,  -1/12,  -1/6,  -1/12,   0,     1/4],
        [1/9,   1/18,  1/36,  1/6,   1/12,  -1/6,  -1/12,   0,    -1/4],
    ], dtype=np.float32)
    M_inv.from_numpy(M_inv_np)